{"firstName":"Selma","lastName":"Karakum","transcript":[{"TRD121":"BA","CSE1200":"CC","PHYS1103":"DD","CSE1241":"AA","PHYS1101":"DD","ATA121":"F","MBG1201":"BA","MATH1001":"F"},{"PHYS1104":"CB","TRD122":"AA","PHYS1102":"CC","NTExxx":"BA","CSE1242":"DC","ATA121":"CC","MATH1001":"DD","MATH2256":"DC"},{"MATH2055":"DC","CSE2023":"AA","ATA122":"DC","MATH1002":"CB","EE2031":"F","MATH2059":"CC"},{"CSE2260":"AA","ECON2004":"BA","STAT2253":"BB","EE2031":"DD","CSE2225":"DC"},{"CSE2246":"CC","IE3081":"F","CSE3055":"DC","CSE3063":"BA","CSE2138":"F","EE2032":"CB"},{"CSE3215":"CB","COM2202":"AA","IE3235":"BB","CSE2138":"F"},{"UE":"DC","CSE4061":"CC","CSE3033":"CC","CSE3000":"AA","CSE2138":"F"},{}],"log":["The advisor didn't allow ATA122 because student failed prereq. ATA121","The advisor didn't allow MATH1002 because student failed prereq. MATH1001","The advisor didn't approve ECON2004 because of total credit","The advisor didn't approve CSE2225 because of total credit","The advisor didn't allow CSE2246 because student failed prereq. CSE2225","The advisor didn't allow EE2032 because student failed prereq. EE2031","The advisor didn't approve CSE2138 because of total credit","The advisor didn't approve CSE3215 because of total credit","The advisor didn't approve CSE3033 because of total credit","The advisor didn't approve CSE3000 because of total credit","The advisor didn't allow CSE3038 because student failed prereq. CSE2138","The advisor didn't approve CSE3044 because of total credit","The advisor didn't approve IE3081 because of total credit","The advisor didn't approve CSE3048 because of total credit","The advisor didn't approve CSE3000 because of total credit","The advisor didn't approve CSE3264 because of total credit","The advisor didn't approve CSE3033 because of total credit","The advisor didn't allow CSE3038 because student failed prereq. CSE2138","The advisor didn't allow CSE4219 because student failed prereq. CSE3038","The advisor didn't approve CSE4000 because of total credit","The advisor didn't approve CSE3264 because of total credit","The advisor didn't approve CSE4074 because of total credit","The advisor didn't approve CSE3048 because of total credit","The advisor didn't approve CSE4297 because of total credit","The advisor didn't approve CSE3044 because of total credit","The advisor didn't approve ISG121 because of total credit","The advisor didn't approve IE3081 because of total credit","The advisor didn't approve CSE4288 because of total credit"],"student_id":"150120177","studentSemester":7}