{"firstName":"Nehir","lastName":"Karakum","transcript":[{"TRD121":"CC","CSE1200":"DC","PHYS1103":"DD","CSE1241":"F","PHYS1101":"AA","ATA121":"CC","MBG1201":"AA","MATH1001":"BB"},{"PHYS1104":"CB","TRD122":"CC","PHYS1102":"F","NTExxx":"CC","CSE1241":"DC","ATA122":"CC","MATH1002":"DC","MATH2256":"BA"},{"PHYS1102":"CB","MATH2055":"CC","CSE1242":"CB","CSE2023":"DD","ECON2004":"BB","MATH2059":"AA"},{"CSE2260":"DC","STAT2253":"DC","CSE2138":"BA","EE2031":"BB","CSE2225":"CB"},{"CSE2246":"AA","IE3081":"CB","CSE3055":"DC","CSE3000":"F","CSE3063":"AA","EE2032":"CC"},{"CSE3215":"CB","CSE3033":"CC","COM2202":"AA","IE3235":"DD"},{"UE":"F","CSE3048":"BB","CSE4070":"DC","CSE3044":"DC","CSE3000":"DD"},{}],"log":["The advisor didn't allow CSE1242 because student failed prereq. CSE1241","The advisor didn't allow CSE2225 because student failed prereq. CSE1242","The advisor didn't allow EE2031 because student failed prereq. PHYS1102","The advisor didn't allow CSE2246 because student failed prereq. CSE2225","The advisor didn't allow EE2032 because student failed prereq. EE2031","The advisor didn't approve CSE3033 because of total credit","The advisor didn't approve CSE3215 because of total credit","The advisor didn't approve CSE3044 because of total credit","The advisor didn't approve CSE3048 because of total credit","The advisor didn't approve CSE3038 because of total credit","The advisor didn't approve CSE3264 because of total credit","The advisor didn't approve CSE3000 because of total credit","The advisor didn't allow CSE4219 because student failed prereq. CSE3038","The advisor didn't approve CSE4074 because of total credit","The advisor didn't approve CSE4000 because of total credit","The advisor didn't approve CSE4297 because of total credit","The advisor didn't approve CSE3264 because of total credit","The advisor didn't approve ISG121 because of total credit","The advisor didn't approve CSE3038 because of total credit","The advisor didn't approve CSE4288 because of total credit"],"student_id":"150120188","studentSemester":7}